/***************************************************************************
 *   Copyright (C) 2024 PCSX-Redux authors                                 *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, write to the                         *
 *   Free Software Foundation, Inc.,                                       *
 *   51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.           *
 ***************************************************************************/

#include <algorithm>
#include <cctype>
#include <cstring>
#include <memory>
#include <string_view>
#include <vector>

#include "flags.h"
#include "fmt/format.h"
#include "support/binstruct.h"
#include "support/file.h"
#include "support/typestring-wrapper.h"
#include "supportpsx/adpcm.h"

// ---------------------------------------------------------------------------
// MOD file structures
// ---------------------------------------------------------------------------

typedef PCSX::BinStruct::Field<PCSX::BinStruct::CString<20>, TYPESTRING("Title")> ModTitle;

typedef PCSX::BinStruct::Field<PCSX::BinStruct::CString<22>, TYPESTRING("Name")> SampleName;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::BEUInt16, TYPESTRING("Length")> SampleLength;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::UInt8, TYPESTRING("FineTune")> SampleFineTune;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::UInt8, TYPESTRING("Volume")> SampleVolume;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::BEUInt16, TYPESTRING("LoopStart")> SampleLoopStart;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::BEUInt16, TYPESTRING("LoopLength")> SampleLoopLength;

typedef PCSX::BinStruct::Struct<TYPESTRING("ModSample"), SampleName, SampleLength, SampleFineTune, SampleVolume,
                                SampleLoopStart, SampleLoopLength>
    ModSample;
typedef PCSX::BinStruct::RepeatedStruct<ModSample, TYPESTRING("ModSamples"), 31> ModSamples;

typedef PCSX::BinStruct::Field<PCSX::BinStruct::UInt8, TYPESTRING("Positions")> Positions;
typedef PCSX::BinStruct::Field<PCSX::BinStruct::UInt8, TYPESTRING("RestartPosition")> RestartPosition;
typedef PCSX::BinStruct::RepeatedField<PCSX::BinStruct::UInt8, TYPESTRING("PatternTable"), 128> PatternTable;

typedef PCSX::BinStruct::Field<PCSX::BinStruct::CString<4>, TYPESTRING("Signature")> Signature;

typedef PCSX::BinStruct::Struct<TYPESTRING("ModFile"), ModTitle, ModSamples, Positions, RestartPosition, PatternTable,
                                Signature>
    ModFile;

// ---------------------------------------------------------------------------
// S3M file structures (ScreamTracker 3, little-endian)
// All offsets follow the official S3M specification.
// Only PCM instruments with 16-bit signed samples are processed.
// ---------------------------------------------------------------------------

// S3M file header – first 96 bytes
#pragma pack(push, 1)
struct S3MHeader {
    char     songName[28];       // 0x00 – null-terminated song title
    uint8_t  sig1;               // 0x1C – always 0x1A
    uint8_t  type;               // 0x1D – file type (0x10 = S3M)
    uint16_t reserved1;          // 0x1E
    uint16_t orderCount;         // 0x20 – number of orders
    uint16_t instrumentCount;    // 0x22 – number of instruments
    uint16_t patternCount;       // 0x24 – number of patterns
    uint16_t flags;              // 0x26
    uint16_t trackerVersion;     // 0x28
    uint16_t sampleFormat;       // 0x2A – 1=signed, 2=unsigned
    char     magic[4];           // 0x2C – "SCRM"
    uint8_t  globalVolume;       // 0x30
    uint8_t  initialSpeed;       // 0x31
    uint8_t  initialTempo;       // 0x32
    uint8_t  masterVolume;       // 0x33
    uint8_t  ultraClickRemoval;  // 0x34
    uint8_t  defaultPan;         // 0x35 – 0xFC means use included pan table
    uint8_t  reserved2[8];       // 0x36
    uint16_t specialPtr;         // 0x3E – parapointer to special data
    uint8_t  channelSettings[32];// 0x40 – 0xFF=unused, 0x80=disabled, 0-15=PCM, 16-31=FM
};

// S3M PCM sample instrument header (type == 1)
struct S3MInstrument {
    uint8_t  type;               // 1 = PCM sample, 2-7 = AdLib
    char     filename[12];       // DOS 8.3 filename
    uint8_t  dataParaHigh;       // high byte of sample data parapointer (Amiga-style high seg)
    uint16_t dataParaLow;        // low word of sample data parapointer
    uint32_t length;             // length in samples
    uint32_t loopBegin;          // loop start in samples
    uint32_t loopEnd;            // loop end in samples
    uint8_t  defaultVolume;      // 0-64
    uint8_t  diskNumber;
    uint8_t  packing;            // must be 0 (uncompressed)
    uint8_t  flags;              // bit 0: loop, bit 2: stereo (not supported here), bit 3: 16-bit
    uint32_t c2spd;              // C-4 frequency in Hz
    uint8_t  reserved[12];
    char     sampleName[28];     // instrument name
